tap "farion1231/ccswitch"

brew "autojump"
brew "the_silver_searcher"
brew "bat"
brew "fd"
brew "brotli"
brew "c-ares"
brew "ca-certificates"
brew "cmake"
brew "gettext"
brew "gh"
brew "htop"
brew "icu4c@78"
brew "lazygit"
brew "libevent"
brew "libgit2"
brew "libnghttp2"
brew "libnghttp3"
brew "libngtcp2"
brew "libssh2"
brew "libunistring"
brew "libuv"
brew "lpeg"
brew "luajit"
brew "luv"
brew "lz4"
brew "mpdecimal"
brew "ncurses"
brew "neovim"
brew "node"
brew "oniguruma"
brew "openssl@3"
brew "pcre2"
brew "python@3.14"
brew "readline"
brew "ripgrep"
brew "simdjson"
brew "sqlite"
brew "tmux"
brew "tree-sitter@0.25"
brew "unibilium"
brew "utf8proc"
brew "uvwasi"
brew "xz"
brew "zsh-autosuggestions"
brew "zstd"

cask "cc-switch"
cask "chatgpt"
cask "chatgpt-atlas"
cask "font-sauce-code-pro-nerd-font"
cask "google-chrome"
cask "hiddenbar"
cask "ghostty"
cask "iterm2"
cask "karabiner-elements"
cask "monitorcontrol"
cask "motrix"
cask "plistedit-pro"
cask "telegram"
cask "wechat"
cask "wpsoffice"
